Revit 2017 API
BuiltInFailures.MEPCalculationFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.MEPCalculationFailures type exposes the following members.
Properties
Name | Description
DuctFittingAndAccessoryPressureDropCalculatorNotAvailable
 Duct Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]
DuctPressureDropCalculatorNotAvailable
 Duct Pressure Drop Calculator Not Available: [Calculator Name]
PipeFittingAndAccessoryPressureDropCalculatorNotAvailable
 Pipe Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]
PipePressureDropCalculatorNotAvailable
 Pipe Pressure Drop Calculator Not Available: [Calculator Name]
PlumbingFlowCalculatorNotAvailable
 Plumbing Flow Calculator Not Available: [Calculator Name]
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace